

# ECS 管理

云计算基础服务  ->  云服务器 ECS  ->  实例 （顶部菜单栏选择区域：杭州、上海...）

单击 “实例名称” 或右侧 “管理” 按钮进入实例详情页，可查看实例具体配置信息。

“实例列表” 页右上角有 “创建实例” 按钮，可以创建新的 ECS，创建的配置参考现有实例，一般无较大改动，只需根据项目需求适当调整参数。地域一般选杭州（华东一）或上海（华东二），无特别差异，但唯一需要注意的是，ECS 实例的地区和 OSS bucket 的地区是绑定的，比如上海的 ECS 只可访问上海的 OSS bucket。镜像一般选择阿里的公共镜像（比如现在常用 Ubuntu 16.04），也可选择自己基于现有 ECS 通过 Snapshot 制作的自定义镜像，需注意的是在新的 ECS 启动后，需要修改 maximum 用户密码（想到其他的再补充）。

另外，有时会收到阿里云的邮件，报告 ECS 有漏洞或者是异常登录情况，邮件中有相应链接，也可前往 ECS 控制台查看红色的警告事件，一般漏洞都是过期需要打得补丁，异常登录是由于 VPN。

对于快到期的 ECS，阿里云也会发邮件提醒，在 “实例列表” 页右侧的控制栏可直接点击 “续费” 按钮操作。和购买一样，别忘了提 PTR。


# OSS

云计算基础服务  ->  对象存储 OSS

概览页面右上角的控制栏有 “新建 Bucket” 按钮可新建，右边的 “Access Key” 可查看账户的身份认证，将用于代码中使用 OSS 的认证。第三行可查看或购买资源包。


新建 bucket：
填写自定义 bucket 名称（即该 bucket 子域名），选择区域，注意需要和你希望使用的 ECS 在同一个地区，存储类型选择 “标准存储”，读写权限选择 “公共读”

进入 bucket 详情页，可查看流量等使用情况，控制面板有很多功能，可上传下载文件，基础设置里还可进行跨域设置。


# Snapshot

实例详情页右侧可查看此盘与快照数，点击数字可进入列表

云计算基础服务  ->  云服务器 ECS  ->  云盘

通过右侧控制栏 “设置自动快照策略” 创建磁盘快照策略

云计算基础服务  ->  云服务器 ECS  ->  快照和镜像

快照列表： 查看所有备份
快照链： 查看所有备份磁盘
自动快照策略： 管理快照策略
快照容量： 查看当前所有快照占用的容量，以此信息来决定购买容量大小
镜像： 可基于快照创建系统镜像，在新建 ECS 时可以选择自定义的镜像


# DNS

域名与网站（万网） ->  域名  ->  域名列表

找到需要操作的域名，点击进入 “域名控制台 - 基本信息”，可以查看域名的基本信息，包括 DNS 服务器，如果是万网服务器，即可在阿里云解析 DNS 上直接配置，否则要去响应的 DNS 服务提供商网站配置。同样，如果要变更 DNS 服务器为阿里万网服务器，则点击 “修改域名DNS” 即可。

域名与网站（万网） ->  云解析 DNS  ->  域名解析  ->   域名解析列表
找到需要操作的域名，点击进入，点击右侧 ”添加记录“ 按钮创建 DNS。
记录类型 A 用来创建指向具体服务器ip的记录
记录类型 CNAME 用来创建指向另一个域名的别名记录
主机记录 @ 用来创建裸域名，即仅包含主域名自身而无子域名
主机记录 * 用来创建范域名，即匹配所有当级的子域名，不包括更深的三级以上域名

当我们使用 CDN 后，记录类型一般使用的都是 CNAME 将域名指向 CDN 的 CNAME 记录。


# CDN

云计算基础服务  ->  CDN  ->  域名管理

在顶部点击 “添加域名” 按钮添加 CDN 记录：填入需要加速的域名，支持范域名，业务类型选择 “图片小文件”，源站类型根据实际情况选择，加速 OSS bucket 的话就选择 “OSS 域名” 并在下拉框选择需要加速的 OSS bucket；加速 ECS 的话选择 IP 并填入服务器 ip 地址；如果已经配置过域名，可以选择 “源站域名” 并填入对应域名。端口根据实际情况选择，配置了 HTTPS 就选择 443，创建之后也可更改。加速区域按照实际情况选择，需注意的是创建之后不可更改，如要更改加速区域只能删除重建 CDN 记录。点击 "下一步" 完成配置，需要花5分钟左右时间等待 CDN 配置完成，然后就能得到该记录对应的 CNAME 记录值，按照在 DNS 中说的方法配置 DNS 即可。

在 CDN 域名管理列表页，点击进入 CDN 配置详情页，这里有 CDN 所有可操作的配置选项

回源设置：协议跟随回源开启后可选择回源方式是 Http 还是 Https，“跟随” 选项是使用访问的方式回源，即 http->http, https->https （这个选项是最好需要配置完 https 后再根据需求使用，一般情况下生产环境都是强制跳转到 https 的，只要在 https 设置就行了，回源方式用默认就行）

缓存设置：可设置缓存过期时间 和 HTTP 响应头，注释说有 9 个自定义取值，实际上有 10 个可配置，包括 CORS。

HTTPS 设置：开启后有三个选项
自有证书：上传自己的证书，比如用 letsencrypt 生成的证书，将证书的 pem 和 key 文件内容分别粘贴入 “公钥” 和 “私钥”，并填写自定义的证书名称
阿里云证书：直接在 “选择证书” 下拉框选择购买的阿里云证书（不过首次配置一般是从云盾服务将证书推送至 CDN）
免费证书：我没试过，下次配置可以尝试，阿里云应该会自动签发，比自己去买免费的要方便多了，而且会自动续签。

强制跳转：CDN 直接强制使用的协议，一般生产都使用 "HTTP->HTTPS" 选项，将 http 访问强制跳转到 https。但是需注意 “默认” 不代表不跳转，如要不跳转，需在顶部的回源设置处设置 “协议跟随回源” 为 “跟随”


# SSL

安全（云盾） ->  CA证书服务（数据安全）

分别有 “我的订单” 和 “我的证书” 两个选项卡可查看所有的证书情况

购买一年的免费证书：
购买证书  ->  选择 “1个域名” “Symantec” “免费型DV SSL”  ->  立即购买
购买一年的通配符域名证书：
购买证书  ->  选择 “通配符域名” “Geotrust/Symantec”  ->  立即购买

购买后在 “我的订单” 页面可以看到新生成的订单，在 “进度” 栏单击 “补全”，按照实际情况补全信息，按照要求进行审核，阿里会给出审核方式说明。
1. DNS
如果 DNS 是配置在阿里云解析 DNS，则证书审核选择 “DNS”，阿里会自动审核并签发证书
2. 文件
如果 DNS 不在阿里，则选择文件方式，需要手动下载审核文件，上传至服务器指定目录，然后点击 “检查配置”，如果结果成功，则只需等待一段时间证书即会自动签发。一般等待时间小于半小时。



# Support

在 “管理控制台” 的顶部菜单栏单击 “工单” 按钮，进入工单系统，可查看历史工单记录。左侧菜单栏有 “提交工单” 按钮，点击后进入提问页面，选择问题对应的领域，比如 ECS 问题或者 CDN 问题，点击 “提问” 后会出现热点文档的索引，可先查看是否有对应文档可解决问题，若无，点击任意文档后在右下角会跳出 “创建工单” 按钮，点击后即可进入工单提交页面，填写相应问题信息即可。一般手机号可改成自己的，以方便联系，如果情况紧急，可以在问题中说明让对方打电话过来联系。




